Revit 2027 API
RepeatingReferenceSource.HasRepeatingReferenceSource Method
 Determines whether an element has any repeating reference sources that can be used when creating component repeaters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool HasRepeatingReferenceSource(
	Document document,
	ElementId elementId
)
Public Shared Function HasRepeatingReferenceSource (
	document As Document,
	elementId As ElementId
) As Boolean
public:
static bool HasRepeatingReferenceSource(
	Document^ document,
	ElementId^ elementId
)
static member HasRepeatingReferenceSource :
        document : Document *
        elementId : ElementId -> bool
Parameters
document Document
 The document that contains the element.
elementId ElementId
 The id of the element.
Return Value
Boolean
 True if the element has any repeating reference sources.
Exceptions
Exception | Condition
ArgumentException |  The element elementId does not exist in the document
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RepeatingReferenceSource Class
Autodesk.Revit.DB Namespace